#+TITLE: Learn Elisp The Hard Way

* lesson-2-1-first-elisp-programme
#+begin_src emacs-lisp
(+ 1 2)
#+end_src

#+RESULTS:
: 3

#+begin_src emacs-lisp
(+ 1.0 2.0)

#+end_src

#+RESULTS:
: 3.0

#+begin_src emacs-lisp
(+ 1.0e+3 2.0e-2)
#+end_src

#+RESULTS:
: 1000.02

#+begin_src emacs-lisp
(- 3 4)
#+end_src

#+RESULTS:
: -1

#+begin_src emacs-lisp
(* 4 5)
#+end_src

#+RESULTS:
: 20

#+begin_src emacs-lisp
(/ 1 4)
#+end_src

#+RESULTS:
: 0

#+begin_src emacs-lisp
(/ 1 4.)
#+end_src

#+RESULTS:
: 0
